OpenFOAM-2.3.1/tutorials/lagrangian/reactingParcelFilmFoam/rivuletPanel/system/extrudeToRegionMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      extrudeToRegionMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

region          wallFilmRegion;

faceZones       (wallFilmFaces);

oneD            false;

sampleMode      nearestPatchFace;

extrudeModel    linearNormal;

nLayers         1;

expansionRatio  1;

adaptMesh       yes; // apply mapped to both regions

linearNormalCoeffs
{
    thickness       0.01;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
